;Place localized text in this file


[SparkArtillery X2SoldierClassTemplate]
DisplayName="Spark：炮兵"
ClassSummary="远程火力支援。装备重型加农炮和弹药发射器。"
+AbilityTreeTitles = "警戒"
+AbilityTreeTitles = "重型加农炮"
+AbilityTreeTitles = "进攻性弹药"
+AbilityTreeTitles = "支援性弹药"

RankNames[0]="新人"
RankNames[1]="侍从"
RankNames[2]="志士"
RankNames[3]="骑士"
RankNames[4]="武士"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="冠军"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank0_squire"
+RankIcons[2]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank1_aspirant"
+RankIcons[3]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank2_knight"
+RankIcons[4]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank3_cavalier"
+RankIcons[5]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank4_vanguard"
+RankIcons[6]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank5_paladin"
+RankIcons[7]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank6_champion"

[SparkTank X2SoldierClassTemplate]
DisplayName="Spark：先锋"
ClassSummary="前线近战与战场控制。装备焚化器和盾牌。"
+AbilityTreeTitles = "化学投掷器"
+AbilityTreeTitles = "焚化者”"
+AbilityTreeTitles = "坦克战术"
+AbilityTreeTitles = "近战"

RankNames[0]="新人"
RankNames[1]="侍从"
RankNames[2]="志士"
RankNames[3]="骑士"
RankNames[4]="武士"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="冠军"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank0_squire"
+RankIcons[2]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank1_aspirant"
+RankIcons[3]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank2_knight"
+RankIcons[4]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank3_cavalier"
+RankIcons[5]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank4_vanguard"
+RankIcons[6]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank5_paladin"
+RankIcons[7]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank6_champion"

[SparkInfiltrator X2SoldierClassTemplate]
DisplayName="Spark：渗透者"
ClassSummary="隐蔽行动、黑客攻击与战斗支援。装备Spark步枪与BIT或小精灵。"
+AbilityTreeTitles = "渗透"
+AbilityTreeTitles = "步枪"
+AbilityTreeTitles = "支援BIT"
+AbilityTreeTitles = "进攻BIT"

RankNames[0]="新人"
RankNames[1]="侍从"
RankNames[2]="志士"
RankNames[3]="骑士"
RankNames[4]="武士"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="冠军"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank0_squire"
+RankIcons[2]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank1_aspirant"
+RankIcons[3]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank2_knight"
+RankIcons[4]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank3_cavalier"
+RankIcons[5]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank4_vanguard"
+RankIcons[6]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank5_paladin"
+RankIcons[7]="UILIbrary_CloistaPCP_Sparks.RankIcons.rank6_champion"

;***************************************
;New Ability Descriptions
;***************************************
[WOTC_APA_profSparkCoreSystems X2AbilityTemplate]
LocFriendlyName = "核心Spark系统"
LocHelpText = "所有熟练Spark等级的核心Spark系统都会随着经验提升而改进。"
LocLongDescription = "所有熟练Spark等级的核心Spark系统都会随着经验提升而改进。"
LocPromotionPopupText = "<font color='#CA7200'>等级 I</font> （在 <Ability:RANKNAME1/> 军衔[1]时获得）<br/><Bullet/> 过载 - 本回合内执行三次动作，且没有动作是回合结束动作。第一次射击后，连续进行标准射击会有15%的瞄准惩罚。4回合冷却时间。<br/><Bullet/>动能打击 - 使用毁灭性的拳头攻击移动范围内的任何敌人。2回合冷却时间。伤害取决于装备的机甲。<br/><Bullet/>机器人机甲 - 该单位免疫火焰和毒伤害，并为相邻的盟友提供完全掩护。<br/><Bullet/>任何单一来源对 <Ability:ClassName/> 造成的伤害不能超过其最大生命值的75%。<br/><font color='#CA7200'>等级 II</font> （在 <Ability:RANKNAME3/> 军衔[3]时获得）<br/><Bullet/>反击 - <Ability:ClassName/> 可以对进入或从近战范围攻击的任何敌人投掷造成一半伤害的打击攻击。不需要动能打击能力。<br/><Bullet/>重启 - 如果SPARK受到足够伤害而被击杀，其生命值将减少至仅剩1点，并在本回合剩余时间内获得护盾。每个任务只能触发一次，之后SPARK将残废。<br/><font color='#CA7200'>等级 III</font> （在 <Ability:RANKNAME6/> 军衔[6]时获得）<br/><Bullet/>超新星 - 冲锋到一个位置并使 <Ability:ClassName/>的反应堆过载，对附近所有单位造成巨大伤害。 <Ability:ClassName/> 将昏迷1回合。<br/><Bullet/>冗余系统 - SPARK在重启后不再受到任何状态惩罚。<br/><Bullet/>小型动能板甲 - 获得2点护盾生命值。当敌人未命中时，再生2点护盾生命值。<br/>

[OverdriveSerial X2AbilityTemplate]
LocFriendlyName = "过载：连续射击"
LocHelpText = "在过载期间，获得连续射击：使用标准射击击杀敌人时返还行动点数。每次射击后重新装填弹药。"
LocLongDescription = "在过载期间，获得连续射击：使用标准射击击杀敌人时返还行动点数。每次射击后重新装填弹药。"
LocPromotionPopupText = "在过载期间，获得连续射击：一种强大的连锁射击能力。每使用重型加农炮的标准火力击杀一次，你的行动点数将被返还。 连锁击杀时，暴击几率降低。每次射击后重新装填弹药。"

[BugOutEvac X2AbilityTemplate]
LocFriendlyName = "紧急撤离"
LocHelpText = "所有SPARK在过载期间（或其他获得额外行动点数的情况下）都可以进行撤离。"
LocLongDescription = "所有SPARK在过载期间（或其他获得额外行动点数的情况下）都可以进行撤离。""
LocPromotionPopupText = "所有SPARK在过载期间（或其他获得额外行动点数的情况下）都可以进行撤离。"


; - GTS Unlocks -

[WOTC_APA_SparkUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "Spark：改进核心系统 I"
Summary = "所有Spark的核心Spark系统熟练度现在将从2级开始，不受等级影响。<br/><br/><font color='#CA7200'>需要先进行变种人MEC拆解。</font>"

[WOTC_APA_SparkUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "Spark：改进核心系统 II"
Summary = "所有Spark的核心Spark系统熟练度现在将从3级开始，不受等级影响。<br/><br/><font color='#CA7200'>需要先完成改进核心系统 I 和 仙女座解剖。</font>"



;blank out old spark
[Spark X2SoldierClassTemplate]
DisplayName="原型Spark：不使用的类别"
ClassSummary="请不要使用。不受熟练Spark支持。请不要使用。"


;add spark localisation to higher tier spark shields for clarity
[SparkBallisticShield_MG X2WeaponTemplate]
FriendlyName="动能Spark盾牌"
FriendlyNamePlural="动能Spark盾牌"
BriefSummary="基本上是一块坠毁UFO外壳的一部分，动能Spark盾牌能够吸收动能，减少弹道射弹的冲击强度。可伸展的翻板可以用来为附近的单位提供额外的保护。"
TacticalText="基本上是一块坠毁UFO外壳的一部分，动能Spark盾牌能够吸收动能，减少弹道射弹的冲击强度。可伸展的翻板可以用来为附近的单位提供额外的保护。<br/><Bullet/> 使用Spark盾牌的近战攻击会使敌人昏迷。<br/><Bullet/> 盾牌将与Spark装甲一起升级。<br/><Bullet/> 携带盾牌会使单位负担加重，导致移动性受到 <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> 的惩罚，命中受到 <Ability:BS_TAG_SHIELD_AIM_PENALTY/> 的惩罚。"
AbilityDescName="盾牌"

[SparkBallisticShield_BM X2WeaponTemplate]
FriendlyName="超铀Spark盾牌"
FriendlyNamePlural="超铀Spark盾牌"
BriefSummary="超铀Spark盾牌基于守护者动力外骨骼装甲的相同技术，并额外使用艾勒里姆能量场来中和进入的射弹。额外的磁悬浮盾发生器允许展开盾牌，为附近的单位提供额外的保护。"
TacticalText="超铀Spark盾牌基于守护者动力外骨骼装甲的相同技术，并额外使用艾勒里姆能量场来中和进入的射弹。额外的磁悬浮盾发生器允许展开盾牌，为附近的单位提供额外的保护。<br/><Bullet/> 使用Spark盾牌的近战攻击会使敌人昏迷。<br/><Bullet/> 盾牌将与Spark装甲一起升级。<br/><Bullet/> 携带盾牌会使单位负担加重，导致移动性受到 <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> 的惩罚，命中受到 <Ability:BS_TAG_SHIELD_AIM_PENALTY/> 的惩罚。"
AbilityDescName="盾牌"


[Obliterator X2AbilityTemplate]
LocFriendlyName="突击伺服"
LocLongDescription="所有打击攻击增加+2伤害和+20瞄准。同时授予破坏球能力。"
LocHelpText="所有动能打击攻击增加+2伤害和+20瞄准。"
LocPromotionPopupText="<Bullet/> 学习突击伺服能力将使所有动能打击攻击增加+2伤害和额外的+20瞄准。<br/><Bullet/> 在伤害加成下，动能打击的伤害将根据装备的Spark机甲分别为8/10/12。<br/><Bullet/> 半伤害打击攻击只获得+1伤害加成。<br/><Bullet/> 破坏球能力包含在此技能中。它允许Spark在使用过载时摧毁其经过的任何环境物体。<br/><Bullet/> 将破坏球过载与动能打击结合使用，不仅可以剥夺目标的掩体，还可以造成大量伤害，并在之后拥有一个行动点。<br/>"
